saved_forms/anna-request2.xml

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
	        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
		  <env:Body>
			      <n1:DiscountServiceRequest xmlns:n1="http://schemas.gid.gap.com/discountService/v1">
				            <RequestDateTime xsi:nil="true"></RequestDateTime>
					          <StoreID xsi:nil="true"></StoreID>
						        <RequestType>LIVE</RequestType>
							      <orderRequest>
								              <OrderID>1234</OrderID>
									              <OrderDate>06/01/2009 14:00</OrderDate>
										              <Channel>POS</Channel>
											              <Brand>Gap</Brand>
												              <Market>CANADA</Market>
													              <OrderLineItems>
															                <SequenceNumber>0</SequenceNumber>
																	          <Product>
																			              <Brand>Gap</Brand>
																				                  <Sku>3127491112</Sku>
																						              <MerchandiseType>7</MerchandiseType>
																							                  <StyleColor>876096041</StyleColor>
																									            </Product>
																										              <Price>
																												                  <NetPrice>29.99</NetPrice>
																														              <PriceType>REGULAR</PriceType>
																															                </Price>
																																	          <Quantity>1</Quantity>
																																		          </OrderLineItems>
																																			          <OrderLineItems>
																																					            <SequenceNumber>1</SequenceNumber>
																																						              <Product>
																																								                  <Brand>Gap</Brand>
																																										              <Sku>3127494512</Sku>
																																											                  <MerchandiseType>7</MerchandiseType>
																																													              <StyleColor>876096051</StyleColor>
																																														                </Product>
																																																          <Price>
																																																		              <NetPrice>19.99</NetPrice>
																																																			                  <PriceType>REGULAR</PriceType>
																																																					            </Price>
																																																						              <Quantity>1</Quantity>
																																																							              </OrderLineItems>
																																																								              <OrderLineItems>
																																																										                <SequenceNumber>2</SequenceNumber>
																																																												          <Product>
																																																														              <Brand>Gap</Brand>
																																																															                  <Sku>3127490012</Sku>
																																																																	              <MerchandiseType>7</MerchandiseType>
																																																																		                  <StyleColor>876096061</StyleColor>
																																																																				            </Product>
																																																																					              <Price>
																																																																							                  <NetPrice>65</NetPrice>
																																																																									              <PriceType>REGULAR</PriceType>
																																																																										                </Price>
																																																																												          <Quantity>1</Quantity>
																																																																													          </OrderLineItems>
																																																																														          <OrderLineItems>
																																																																																            <SequenceNumber>3</SequenceNumber>
																																																																																	              <Product>
																																																																																			                  <Brand>Gap</Brand>
																																																																																					              <Sku>3127492212</Sku>
																																																																																						                  <MerchandiseType>7</MerchandiseType>
																																																																																								              <StyleColor>876096081</StyleColor>
																																																																																									                </Product>
																																																																																											          <Price>
																																																																																													              <NetPrice>29.99</NetPrice>
																																																																																														                  <PriceType>REGULAR</PriceType>
																																																																																																            </Price>
																																																																																																	              <Quantity>1</Quantity>
																																																																																																		              </OrderLineItems>
																																																																																																			              <OrderLineItems>
																																																																																																					                <SequenceNumber>4</SequenceNumber>
																																																																																																							          <Product>
																																																																																																									              <Brand>Gap</Brand>
																																																																																																										                  <Sku>3127494531</Sku>
																																																																																																												              <MerchandiseType>7</MerchandiseType>
																																																																																																													                  <StyleColor>876096091</StyleColor>
																																																																																																															            </Product>
																																																																																																																              <Price>
																																																																																																																		                  <NetPrice>29.99</NetPrice>
																																																																																																																				              <PriceType>REGULAR</PriceType>
																																																																																																																					                </Price>
																																																																																																																							          <Quantity>1</Quantity>
																																																																																																																								          </OrderLineItems>
																																																																																																																									          <Promotions>
																																																																																																																											            <SequenceNumber>0</SequenceNumber>
																																																																																																																												              <PromotionCode>10P50GLIX4</PromotionCode>
																																																																																																																													                <ReceiptMessages></ReceiptMessages>
																																																																																																																															          <PromoUsages></PromoUsages>
																																																																																																																																            <QualifyingTenders xsi:nil="true"></QualifyingTenders>
																																																																																																																																	            </Promotions>
																																																																																																																																		          </orderRequest>
																																																																																																																																			      </n1:DiscountServiceRequest>
																																																																																																																																			        </env:Body>
																																																																																																																																			</env:Envelope>
