saved_forms/jayan-request1.xml

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
	        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
		  <env:Body>
			      <n1:DiscountServiceRequest xmlns:n1="http://schemas.gid.gap.com/discountService/v1">
				            <RequestDateTime xsi:nil="true"></RequestDateTime>
					          <StoreID xsi:nil="true"></StoreID>
						        <RequestType>LIVE</RequestType>
							      <orderRequest>
								              <OrderID>1234</OrderID>
									              <OrderDate>03/18/2009 9:00</OrderDate>
										              <Channel>POS</Channel>
											              <Brand>Banana Republic</Brand>
												              <Market>USA</Market>
													              <OrderLineItems>
															                <SequenceNumber>0</SequenceNumber>
																	          <Product>
																			              <Brand>Banana Republic</Brand>
																				                  <Sku>1230005244</Sku>
																						              <ItemCorpNumber>11</ItemCorpNumber>
																							                  <ItemCompanyNumber>1</ItemCompanyNumber>
																									              <ItemDivisionNumber>12</ItemDivisionNumber>
																										                  <ItemDepartmentNumber>126</ItemDepartmentNumber>
																												              <ItemClassNumber>06</ItemClassNumber>
																													                  <ItemSubClassNumber>02</ItemSubClassNumber>
																															              <MerchandiseType>7</MerchandiseType>
																																                </Product>
																																		          <Price>
																																				              <NetPrice>30</NetPrice>
																																					                  <PriceType>REGULAR</PriceType>
																																							            </Price>
																																								              <Quantity>1</Quantity>
																																									              </OrderLineItems>
																																										              <OrderLineItems>
																																												                <SequenceNumber>1</SequenceNumber>
																																														          <Product>
																																																              <Brand>Gap Outlet</Brand>
																																																	                  <Sku>1230005016</Sku>
																																																			              <ItemCorpNumber>01</ItemCorpNumber>
																																																				                  <ItemCompanyNumber>1</ItemCompanyNumber>
																																																						              <ItemDivisionNumber>16</ItemDivisionNumber>
																																																							                  <ItemDepartmentNumber>163</ItemDepartmentNumber>
																																																									              <ItemClassNumber>16</ItemClassNumber>
																																																										                  <ItemSubClassNumber>00</ItemSubClassNumber>
																																																												              <MerchandiseType>7</MerchandiseType>
																																																													                </Product>
																																																															          <Price>
																																																																	              <NetPrice>15.97</NetPrice>
																																																																		                  <PriceType>MARKDOWN</PriceType>
																																																																				            </Price>
																																																																					              <Quantity>1</Quantity>
																																																																						              </OrderLineItems>
																																																																							              <OrderLineItems>
																																																																									                <SequenceNumber>2</SequenceNumber>
																																																																											          <Product>
																																																																													              <Brand>Banana Republic</Brand>
																																																																														                  <Sku>1230005006</Sku>
																																																																																              <ItemCorpNumber>11</ItemCorpNumber>
																																																																																	                  <ItemCompanyNumber>1</ItemCompanyNumber>
																																																																																			              <ItemDivisionNumber>12</ItemDivisionNumber>
																																																																																				                  <ItemDepartmentNumber>126</ItemDepartmentNumber>
																																																																																						              <ItemClassNumber>05</ItemClassNumber>
																																																																																							                  <ItemSubClassNumber>02</ItemSubClassNumber>
																																																																																									              <MerchandiseType>7</MerchandiseType>
																																																																																										                  <StyleColor>521204001</StyleColor>
																																																																																												            </Product>
																																																																																													              <Price>
																																																																																															                  <NetPrice>35</NetPrice>
																																																																																																	              <PriceType>REGULAR</PriceType>
																																																																																																		                </Price>
																																																																																																				          <Quantity>1</Quantity>
																																																																																																					          </OrderLineItems>
																																																																																																						          <OrderLineItems>
																																																																																																								            <SequenceNumber>3</SequenceNumber>
																																																																																																									              <Product>
																																																																																																											                  <Brand>Banana Republic</Brand>
																																																																																																													              <Sku>1230005245</Sku>
																																																																																																														                  <ItemCorpNumber>11</ItemCorpNumber>
																																																																																																																              <ItemCompanyNumber>1</ItemCompanyNumber>
																																																																																																																	                  <ItemDivisionNumber>12</ItemDivisionNumber>
																																																																																																																			              <ItemDepartmentNumber>126</ItemDepartmentNumber>
																																																																																																																				                  <ItemClassNumber>05</ItemClassNumber>
																																																																																																																						              <ItemSubClassNumber>02</ItemSubClassNumber>
																																																																																																																							                  <MerchandiseType>7</MerchandiseType>
																																																																																																																									              <StyleColor>437205024</StyleColor>
																																																																																																																										                </Product>
																																																																																																																												          <Price>
																																																																																																																														              <NetPrice>22.5</NetPrice>
																																																																																																																															                  <PriceType>REGULAR</PriceType>
																																																																																																																																	            </Price>
																																																																																																																																		              <Quantity>1</Quantity>
																																																																																																																																			              </OrderLineItems>
																																																																																																																																				              <OrderLineItems>
																																																																																																																																						                <SequenceNumber>4</SequenceNumber>
																																																																																																																																								          <Product>
																																																																																																																																										              <Brand>Banana Republic</Brand>
																																																																																																																																											                  <Sku>1230005245</Sku>
																																																																																																																																													              <ItemCorpNumber>11</ItemCorpNumber>
																																																																																																																																														                  <ItemCompanyNumber>1</ItemCompanyNumber>
																																																																																																																																																              <ItemDivisionNumber>12</ItemDivisionNumber>
																																																																																																																																																	                  <ItemDepartmentNumber>126</ItemDepartmentNumber>
																																																																																																																																																			              <ItemClassNumber>05</ItemClassNumber>
																																																																																																																																																				                  <ItemSubClassNumber>02</ItemSubClassNumber>
																																																																																																																																																						              <MerchandiseType>7</MerchandiseType>
																																																																																																																																																							                  <StyleColor>437205024</StyleColor>
																																																																																																																																																									            </Product>
																																																																																																																																																										              <Price>
																																																																																																																																																												                  <NetPrice>22.5</NetPrice>
																																																																																																																																																														              <PriceType>REGULAR</PriceType>
																																																																																																																																																															                </Price>
																																																																																																																																																																	          <Quantity>1</Quantity>
																																																																																																																																																																		          </OrderLineItems>
																																																																																																																																																																			          <Promotions>
																																																																																																																																																																					            <SequenceNumber>0</SequenceNumber>
																																																																																																																																																																						              <PromotionCode>PPNTD2ZKTDF6</PromotionCode>
																																																																																																																																																																							                <ReceiptMessages></ReceiptMessages>
																																																																																																																																																																									          <PromoUsages></PromoUsages>
																																																																																																																																																																										            <QualifyingTenders xsi:nil="true"></QualifyingTenders>
																																																																																																																																																																											            </Promotions>
																																																																																																																																																																												            <MaxDiscountsAllowed>2</MaxDiscountsAllowed>
																																																																																																																																																																													          </orderRequest>
																																																																																																																																																																														      </n1:DiscountServiceRequest>
																																																																																																																																																																														        </env:Body>
																																																																																																																																																																														</env:Envelope>
