saved_forms/.svn/text-base/working.xml.svn-base

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <env:Body>
   <n1:DiscountServiceRequest
xmlns:n1="http://schemas.gid.gap.com/discountService/v1">
     <RequestDateTime xsi:nil="true"></RequestDateTime>
     <StoreID xsi:nil="true"></StoreID>
     <RequestType>LIVE</RequestType>
     <orderRequest>
       <OrderID>1234</OrderID>
       <OrderDate>04/18/2009 9:00</OrderDate>
       <Channel>POS</Channel>
       <Brand>Gap</Brand>
       <Market>CANADA</Market>
       <OrderLineItems>
         <SequenceNumber>0</SequenceNumber>
         <Product>
           <Brand>Gap</Brand>
           <Sku>1230005024</Sku>
           <ItemCorpNumber>01</ItemCorpNumber>
           <ItemCompanyNumber>1</ItemCompanyNumber>
           <ItemDivisionNumber>16</ItemDivisionNumber>
           <ItemDepartmentNumber>163</ItemDepartmentNumber>
           <ItemClassNumber>05</ItemClassNumber>
           <ItemSubClassNumber>01</ItemSubClassNumber>
           <MerchandiseType>7</MerchandiseType>
         </Product>
         <Price>

           <NetPrice>8.97</NetPrice>

           <PriceType>MARKDOWN</PriceType>

         </Price>

         <Quantity>1</Quantity>

       </OrderLineItems>

       <OrderLineItems>

         <SequenceNumber>1</SequenceNumber>

         <Product>

           <Brand>Gap</Brand>

           <Sku>1230005026</Sku>

           <ItemCorpNumber>01</ItemCorpNumber>

           <ItemCompanyNumber>1</ItemCompanyNumber>

           <ItemDivisionNumber>16</ItemDivisionNumber>

           <ItemDepartmentNumber>163</ItemDepartmentNumber>

           <ItemClassNumber>05</ItemClassNumber>

           <ItemSubClassNumber>01</ItemSubClassNumber>

           <MerchandiseType>7</MerchandiseType>

         </Product>

         <Price>

           <NetPrice>75</NetPrice>

           <PriceType>REGULAR</PriceType>

         </Price>

         <Quantity>1</Quantity>

       </OrderLineItems>

       <OrderLineItems>

         <SequenceNumber>2</SequenceNumber>

         <Product>

           <Brand>Gap</Brand>

           <Sku>1230005024</Sku>

           <ItemCorpNumber>01</ItemCorpNumber>

           <ItemCompanyNumber>1</ItemCompanyNumber>

           <ItemDivisionNumber>16</ItemDivisionNumber>

           <ItemDepartmentNumber>163</ItemDepartmentNumber>

           <ItemClassNumber>05</ItemClassNumber>

           <ItemSubClassNumber>01</ItemSubClassNumber>

           <MerchandiseType>7</MerchandiseType>

         </Product>

         <Price>

           <NetPrice>8.97</NetPrice>

           <PriceType>MARKDOWN</PriceType>

         </Price>

         <Quantity>1</Quantity>

       </OrderLineItems>

       <OrderLineItems>

         <SequenceNumber>3</SequenceNumber>

         <Product>

           <Brand>Gap</Brand>

           <Sku>1230005026</Sku>

           <ItemCorpNumber>01</ItemCorpNumber>

           <ItemCompanyNumber>1</ItemCompanyNumber>

           <ItemDivisionNumber>16</ItemDivisionNumber>

           <ItemDepartmentNumber>163</ItemDepartmentNumber>

           <ItemClassNumber>05</ItemClassNumber>

           <ItemSubClassNumber>01</ItemSubClassNumber>

           <MerchandiseType>7</MerchandiseType>

         </Product>

         <Price>

           <NetPrice>75</NetPrice>

           <PriceType>REGULAR</PriceType>

         </Price>

         <Quantity>1</Quantity>

       </OrderLineItems>

       <OrderLineItems>

         <SequenceNumber>4</SequenceNumber>

         <Product>

           <Brand>Gap</Brand>

           <Sku>1230005024</Sku>

           <ItemCorpNumber>01</ItemCorpNumber>

           <ItemCompanyNumber>1</ItemCompanyNumber>

           <ItemDivisionNumber>16</ItemDivisionNumber>

           <ItemDepartmentNumber>163</ItemDepartmentNumber>

           <ItemClassNumber>05</ItemClassNumber>

           <ItemSubClassNumber>01</ItemSubClassNumber>

           <MerchandiseType>7</MerchandiseType>

         </Product>

         <Price>

           <NetPrice>8.97</NetPrice>

           <PriceType>MARKDOWN</PriceType>

         </Price>

         <Quantity>1</Quantity>

       </OrderLineItems>

       <OrderLineItems>

         <SequenceNumber>5</SequenceNumber>

         <Product>

           <Brand>Gap</Brand>

           <Sku>1230005026</Sku>

           <ItemCorpNumber>01</ItemCorpNumber>

           <ItemCompanyNumber>1</ItemCompanyNumber>

           <ItemDivisionNumber>16</ItemDivisionNumber>

           <ItemDepartmentNumber>163</ItemDepartmentNumber>

           <ItemClassNumber>05</ItemClassNumber>

           <ItemSubClassNumber>01</ItemSubClassNumber>

           <MerchandiseType>7</MerchandiseType>

         </Product>

         <Price>

           <NetPrice>75</NetPrice>

           <PriceType>REGULAR</PriceType>

         </Price>

         <Quantity>1</Quantity>

       </OrderLineItems>

       <Promotions>

         <SequenceNumber>0</SequenceNumber>

         <PromotionCode>D198DJ6MYR6N</PromotionCode>

         <ReceiptMessages></ReceiptMessages>

         <PromoUsages></PromoUsages>

         <QualifyingTenders xsi:nil="true"></QualifyingTenders>

       </Promotions>

     </orderRequest>

   </n1:DiscountServiceRequest>
 </env:Body>
</env:Envelope>